#include <stdio.h>           


int main() {              
    // กรณีที่ 1:
    int score1 = 90.5;
    printf("int : %d", score1); // เกิด Error เพราะ ไม่สามารถเก็บค่าทศนิยมได้ในตัวแปรชนิด int

    // กรณีที่ 2:
    float score2 = 90.5;
    printf("float : %f", score2); // แสดงผลได้ถูกต้อง เพราะ float สามารถเก็บค่าทศนิยมได้
}


/*
    int: ใช้เก็บจำนวนเต็ม เช่น 1, 2, 3
    float: ใช้เก็บจำนวนจริงที่มีทศนิยม เช่น 1.5
*/
/*
    แต่ละ Data Type มีขอบเขตและรูปแบบการจัดเก็บข้อมูลต่างกัน
    หากเลือกผิด เช่น ใช้ int กับค่าทศนิยม จะทำให้ข้อมูล สูญหาย (ข้อมูลไม่ครบ)
    อาจเกิด Error หรือ Bug ได้ในโปรแกรมที่ซับซ้อน
*/
/*
    int ใช้สำหรับเก็บ จำนวนเต็ม เท่านั้น ไม่รองรับค่าทศนิยม
    float เหมาะกับค่าที่มีทศนิยม
    การเลือกชนิดข้อมูลผิดพลาดอาจทำให้โปรแกรม แสดงผลลัพธ์ไม่ถูกต้อง
*/